#ifndef LATEX_TEMPLATES_H_
#define LATEX_TEMPLATES_H_


///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

const char* Preamble = 
"\\documentclass[a4paper,fontsize=16pt]{article}\n"
"\\usepackage[cp1251]{inputenc}\n"
"\\textheight=22.5cm % высота текста\n"
"\\textwidth=17cm % ширина текста\n"
"\\oddsidemargin= 0pt % отступ от левого края\n"
"\\topmargin=-1.5cm % отступ от верхнего края\n"
"\\parindent=24pt % абзацный отступ\n"
"\\parskip=0pt % интервал между абзацами\n"
"\\usepackage[russian]{babel}\n"
"\\usepackage{titlepic}\n"
"\\usepackage{graphicx}\n"
"\\usepackage{amssymb}\n"
"\\usepackage{amsmath}\n"
"\\usepackage{graphicx}\n"
"\\usepackage{color,colortbl, xcolor}\n"
"\\usepackage{pgf}\n"
"\\usepackage[normalem]{ulem}"
"\\renewcommand\\contentsname{Содержание}\n\n";

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

const char* FirstPage = 
"\\begin{document}\n\n"
  
"\\begin{figure}\n"
"\\includegraphics[width=5cm]{MIPT_logo.png}\n"
"\\end{figure}\n\n"
  
"\\begin{center}\n"
"\\normalsize Московский физико-технический институт \\\\(госудраственный университет)\n"
"\\end{center}\n" 
"\\vspace{3cm}\n" 
"\\begin{center}\n\n" 

"\\textbf {\\huge{Практическое руководство по дифференцированию}}\n\n"
  
"\\vspace{0.5cm}\n\n" 
  
"\\textbf {\\large{Методическое пособие по дисциплине\\break <<Введение в математический анализ>>"
"\\break\\break 1 курс}}\n\n"

"\\vspace{0.5cm}\n\n"

"\\Large{{\\textbf {Маслов А.С.}}}\n\n"
 
"\\end{center}\n\n"
 
"\\vspace{\\fill}\n"
"\\begin{center}\n"
"Долгопрудный \\\\2021\n"
"\\end{center}\n\n";

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

const char* Contents = 
"\\newpage\n\n"
"\\tableofcontents\n\n";

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

const char* Introduction = 
"\\newpage\n\n"

"\\section{Введение}\n\n"

"\\large{В пособии рассматриваются методы решения задач на взятие производных. "
"В начале рассматриваются производные элементарных функций, приводится необходимая теория для решения "
"сложных задач. Далее рассматриваются примеры решения задач.}\n\n";

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

const char* Theory = 
"\\newpage\n\n"

"\\section{Производные элементарных функций}\n\n\n"


"Из школьного курса алгебры известно, что\n\n"

"\\begin{enumerate}\n"
"\\item $c^\\prime = 0$.\n"
"\\item $x^\\prime = 1$.\n"
"\\item $(\\sqrt{x})^\\prime = \\frac{1}{2\\sqrt{x}}$.\n"
"\\end{enumerate}\n\n\n"


"Производная степенной функции:\n\n"

"$(x^n)^\\prime = n \\cdot x^{n-1}$.\n"
"\\vspace{0.5cm}\n\n"

"Производные показательной и логарифмической функций:\n\n"

"\\begin{enumerate}\n"
"\\item $(a^x)^\\prime = a^x \\cdot \\ln{a}$\n"
"\\item $(e^x)^\\prime = e^x$\n"
"\\item $\\log_{a}{x} = \\frac{1}{x\\ln{a}}$\n"
"\\item $(\\ln{x})^\\prime = \\frac{1}{x}$\n"
"\\end{enumerate}\n\n\n"


"Производные тригонометрических функций:\n\n"

"\\begin{enumerate}\n"
"\\item $(\\sin{x})^\\prime = \\cos{x}$\n"
"\\item $(\\cos{x})^\\prime = -\\sin{x}$\n"
"\\item $(\\tan{x})^\\prime = \\frac{1}{(\\cos{x})^2}$\n"
"\\item $(\\cot{x})^\\prime = \\frac{1}{(\\sin{x})^2}$\n"
"\\end{enumerate}\n\n\n"


"Производные обратных тригонометрических функций:\n\n"

"\\begin{enumerate}\n"
"\\item $(\\arcsin{x})^\\prime = \\frac{1}{\\sqrt{1 - x^2}}$\n"
"\\item $(\\arccos{x})^\\prime = \\frac{-1}{\\sqrt{1 - x^2}}$\n"
"\\item $(\\arctan{x})^\\prime = \\frac{1}{1 + x^2}$\n"
"\\end{enumerate}\n\n\n"


"Производные гиперболических функций:\n\n"

"\\begin{enumerate}\n"
"\\item $(\\sinh{x})^\\prime = \\cosh{x}$\n"
"\\item $(\\cosh{x})^\\prime = \\sinh{x}$\n"
"\\end{enumerate}\n\n\n"


"Данного теоретического материала достаточно, чтобы приступить к решению практических задач.\n\n";

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

const char* Problems = 
"\\newpage\n\n"

"\\section{Примеры решения задач}\n\n"

"\\hfill \\break\n"
"\\fbox{\\textbf{Задача 1}}\n\n"

"Найти производную $";

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

const char* Solution = 
"$\n\n\\textbf{Решение:}\n\n";

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

const char* Literature = 
"\\newpage\n\n"

"\\section{Список используемой литературы}\n\n"

"\\begin{enumerate}\n"
"\\item А.Ю.Петрович. Лекции по математическому анализу. Ч.1. Введение в математический анализ --- М.: "
"Печатный салон ШАНС, 2017. --- 274 с.\n"
"\\item Кудрявцев Л.Д, Курс математического анализа. Т.1. --- М.: Высшая школа, 1981. --- 688 с.\n"
"\\item Никольский С.М. Курс математического анализа. Т.1. --- 4-е изд. --- М.: Наука, 1990. --- 528 с.\n"
"\\item Тер-Крикоров А.М., Шабунин М.И. Курс математического анализа. --- М.: Наука, 1988. --- 816 с.\n"
"\\item Яковлев Г.Н. Лекции по математическому анализу. Ч.1. --- М.: Физматлит, 2001. --- 400 с.\n"
"\\item Бесов О.В. Лекции по математическому анализу. --- М.: Физматлит, 2014. --- 480 с.\n"
"\\item Иванов Г.Е. Лекции по математическому анализу. Ч.1. --- М.: МФТИ, 2011. --- 318 с.\n"
"\\item Фихтенгольц Г.М, Курс дифференциального и интегрального исчисления. --- 7-у изд. --- М.: Наука, "
"1969. --- 608 с.\n"
"\\item Кудрявцев Л.Д., Кутасов А.Д., Чехлов В.И., Шабунин М.И. Сборник заадч по математическому анализу. "
"Предел, непрерывность, дифференцируемость /под ред. Л.Д.Кудрявцева. --- 2-е изд. --- М.: Физматлит, "
"2003. --- 496 с.\n"
"\\item Демидович Б.П. Сборник задач и упражнений по математическому анализу. --- 10-е изд. --- М.: Наука, "
"1990. --- 624 с.\n"
"\\end{enumerate}\n\n"

"\\end{document}\n";

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\


#endif